#include <stdio.h>
#include <string.h>
//整数的二进制表示方法有三种 原码 反码 补码
//二进制中最高的一位叫做发符号位 0 正 1 负
//正整数的原 反 补 码均相同
//负整数 原码   反码是原码除符号位按位取反 补码是反码+1
//无符号整数三种2进制也相同
//移位操作符  << 左移  >> 右移
//左移 左边抛弃 右边补0
// int main()
// {
//     int n = 10;  //    1010  10   10100 20
//     int z = n << 1;
//     printf("%d",z);
//     return 0;
// }

//右移 分为逻辑右移：左边补0 右边丢弃    算数右移 左边用原符号位 右边丢弃
//同时对于移位运算符 不可移动负数位


// &按位与   |按位或   ^按位异或  ~ 按位取反
//&按位与 全1为1 有0则0
//|按位或  有1则1 全0才0
//^按位异或 不一样得1 一样得0
//重要  存的是补码 算出来的也是补码 要注意 
//不创建第三个变量，实现2个整数的交换
// int main()
// {
//     int a = 10; //   只看后8位       00001010
//     int b = 20; //                       00010100
//     a = a ^ b;//按位异或 相同为0 不同为1   00011110
//     b = a ^ b;                   //      00001010
//     a = a ^ b;                      //   00010100
//     printf("a = %d b = %d ",a,b);  //完成交换
//     return 0
// }

//编写代码 求一个整数存储在内存中得二进制1的个数
//方法一 结合1234 / 10 = 123 去掉最低位来思考
// int main()
// {
//     int num = 10;  
//     int count = 0;
//     if(num % 2 = 1)
//     {
//         count++;  //5 +1  1  +1  变成2
//     }
//     num /= 2;  //    1010   --> 101 5 --> 10 2  --> 1 1
//     return 0;
// }
//缺点 ： 对于负数存在符号位  没办法算负数的1的个数 
//根据&按位与的特性 全1为1 有0则0
//考虑到方便判断 再引入1 即除了一个1 别的都是0 这样再按位与的过程中方便判断
//通过左移位 判断每一位是否全1为1
// int main()
// {
//     int num = 10;
//     int i = 0;
//     int count = 0;
//     for(i=0;i<32;i++)
//     {
//         if(num & 1<<i)
//         {
//             count++;
//         }
//     }
//     printf("⼆进制中1的个数 = %d\n", count);
//     return 0;
// }

//值得注意的是在此过程中循环了32次，有无方法可以优化
//num = num & (num - 1) 用来消掉最右边的1 10    1010      9      1001
//  10 & 9 1000

//二进制位置0 或者置1
// int main()
// {
//     int a = 13;
//     //首先要置1 保留原有的1 不动 考虑有1为1 用按位或
//     a = a | (1<<4);
//     //再改回0
//     a = a & ~(i<<4);  //先把后面的按位取反，就只有第五位为0 其他全1 再巧妙利用按位与
//     return 0;
// }

//逗号表达式，从左向右依次执⾏。整个表达式的结果是最后⼀个表达式的结果。
//int a = 1;
//int b = 2;
//int c = (a > b, a = b + 10, a, b = a + 1); //13
// a = get_val();
// count_val(a);
// while (a > 0)

// {
//     //业务处理
//     //...
//     a = get_val();
//     count_val(a);
// }
// while(a = get_val(), count_val(a), a>0)
// {
//     //业务处理
// }
//结构体
//描述一个学生
// struct Stu 
// {
//     char name[20];
//     int age;
//     char sex[5];
//     char id[20];
// };
//结构体变量的定义和初始化
// struct Point
// {
//     int x;
//     int y;
// }p1;   //声明结构体类型并定义变量p1
// struct Point p2;  //定义p2
// struct Stu //类型声明
//     {
//     char name[15];//名字
//     int age; //年龄
// };
// struct Stu s1 = {"zhangsan",20};  //初始化
// struct Stu s2 = {.age = 20,.name = "lsit"};  //指定顺序初始化
// struct Node{
//     int data;
//     struct Point p1;
//     struct  Node* next;
// }n1 = {10,{4,5},NULL};  //结构体嵌套初始化
// struct Node n2 = {20,{5,6},NULL};

// struct Point
// {
//     int x;
//     int y;
// }p1 = {4,5};
// int main()
// {
//     printf("x = %d y = %d",p1.x,p1.y);  //结构体直接访问是通过.直接访问  .接受2个操作数
//     return 0;
// }

//结构体间接访问 得到了一个指向结构体的指针。
// struct Point 
// {
//     int x;
//     int y;
// };
// int main()
// {
//     struct Point p1 = {4,5};
//     struct Point *ptr = &p;
//     ptr->x = 10;
//     ptr->y = 20;
//     printf("x = %d y = %d",ptr->x,ptr->y);
//     return 0;
// } //结构体指针 -> 成员名
// struct stu
// {
//     char name[15];
//     int age;
// };
// void print_stu(struct stu s)
// {
//     printf("%s:%d",s.name,s.age);
// }
// void set_stu(struct stu* ptr)
// {
//     strcpy(ptr->name,"李四");  //指向的是数组 代表首元素地址不可赋值
//     ptr->age = 28;
// }
// int main()
// {
//     struct stu s = {"张三",20};
//     print_stu(s);
//     set_stu(&s);
//     print_stu(s);
//     return 0;
// }

//操作符的优先级 结合性
// 圆括号（ () ）
// • ⾃增运算符（ ++ ），⾃减运算符（ -- ）
// • 单⽬运算符（ + 和 - ）
// • 乘法（ * ），除法（ / ）
// • 加法（ + ），减法（ - ）
// • 关系运算符（ < 、 > 等）
// • 赋值运算符（ = ）

//表达式求值
//由于cpu 诸如char 类型的数据要进行整形提升
//1.有符号整数 按照符号位来提升
//2.无符号整数 高位补0
// char c1 = -1;
// 1111111
// 11111111111111111111111111111111
// char c2 = 1;
// 00000001
// 00000000000000000000000000000001
//问题表达式
// c + --c
// 同上，操作符的优先级只能决定⾃减 -- 的运算在 + 的运算的前⾯，但是我们并没有办法得知， + 操
// 作符的左操作数的获取在右操作数之前还是之后求值，所以结果是不可预测的，是有歧义的。
// int fun()
// {
//     static int count = 1;
//     return ++count;
// }
//     int main()
// {
//     int answer;
//     answer = fun() - fun() * fun();
//     printf( "%d\n", answer);//输出多少？
//     return 0;
// }  
// 但是上述代码 answer = fun() - fun() * fun(); 中我们只能通过操作符的优先级得知：先
// 算乘法，再算减法。
// 函数的调⽤先后顺序⽆法通过操作符的优先级确定。 即不确定fun()在使用时到底是几
